<template>
  <div class="hotlist flex flex-col">
    <Hot :data="list" />
    <a-pagination
      :current="currentPage"
      :pageSize="10"
      :total="200"
      show-quick-jumper
      hideOnSinglePage
      class="my-3"
      @change="onChange"
    />
  </div>
</template>

<script lang="ts">
import { defineComponent, ref } from 'vue'
import { requestBlogList } from '~/api'

export default defineComponent({
  setup() {
    const currentPage = ref(1)

    const getData = async () => {
      const res = await requestBlogList(currentPage.value, 10)

      console.log(res)
    }

    const onChange = (page: number) => {
      currentPage.value = page

      getData()
    }

    return {
      list: [
        {
          id: 1,
          title: '恭喜你通关2021，进入下一关2022',
          author: 'ISaw',
          content:
            '律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。...',
          time: '2021-12-31',
          read: 1756,
          discuss: 6,
          img: 'https://www.talklee.com/zb_users/upload/2021/12/202112311640917749854303.png'
        },
        {
          id: 2,
          author: 'ISaw',
          title: '恭喜你通关2021，进入下一关2022',
          content:
            '律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。...',
          time: '2021-12-31',
          read: 156,
          discuss: 6,
          img: 'https://www.talklee.com/zb_users/upload/2021/12/202112311640917749854303.png'
        },
        {
          id: 2,
          author: 'ISaw',
          title: '恭喜你通关2021，进入下一关2022',
          content:
            '律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。...',
          time: '2021-12-31',
          read: 1756,
          discuss: 6,
          img: 'https://www.talklee.com/zb_users/upload/2021/12/202112311640917749854303.png'
        },
        {
          id: 2,
          author: 'ISaw',
          title: '恭喜你通关2021，进入下一关2022',
          content:
            '律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。...',
          time: '2021-12-31',
          read: 1756,
          discuss: 6,
          img: 'https://www.talklee.com/zb_users/upload/2021/12/202112311640917749854303.png'
        },
        {
          id: 2,
          author: 'ISaw',
          title: '恭喜你通关2021，进入下一关2022',
          content:
            '律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。...',
          time: '2021-12-31',
          read: 1756,
          discuss: 6,
          img: 'https://www.talklee.com/zb_users/upload/2021/12/202112311640917749854303.png'
        },
        {
          id: 2,
          author: 'ISaw',
          title: '恭喜你通关2021，进入下一关2022',
          content:
            '律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。...',
          time: '2021-12-31',
          read: 1756,
          discuss: 6,
          img: 'https://www.talklee.com/zb_users/upload/2021/12/202112311640917749854303.png'
        },
        {
          id: 2,
          author: 'ISaw',
          title: '恭喜你通关2021，进入下一关2022',
          content:
            '律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。...',
          time: '2021-12-31',
          read: 1756,
          discuss: 6,
          img: 'https://www.talklee.com/zb_users/upload/2021/12/202112311640917749854303.png'
        },
        {
          id: 2,
          author: 'ISaw',
          title: '恭喜你通关2021，进入下一关2022',
          content:
            '律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。律回春渐，新元肇启，烟火夜白。朝朝暮暮，沉淀过往，迎来新光。还有十几个小时，我们将跨越2021，进入2022，你的时光列车即将出发。回顾这一年，你有没有哪一刻感觉自己被上天眷顾到了?这一年，人类仍然生活在扫雷游戏里。...',
          time: '2021-12-31',
          read: 1756,
          discuss: 6,
          img: 'https://www.talklee.com/zb_users/upload/2021/12/202112311640917749854303.png'
        }
      ],
      currentPage,
      onChange
    }
  }
})
</script>
